export type GameType = "tapRush" | "catchButton" | "findEmoji" | "codePuzzle" | "mazeMini" | 'catchGame';

export interface QuestStep {
	id: number;
	game?: {
		type: GameType,
		rule: string;
		name: string;
	};
	riddle: string;
}

export const questSteps: QuestStep[] = [
	{
		id: 1,
		game: {
			type: "tapRush",
			rule: 'Тапай по кружкам так же быстро, как тапаешь на шкоду',
			name: 'СУПЕРТАП'
		},
		riddle: "Саня оставляет черкаши не только на унитазе, а ещё на этом предмете в вашей квартире. Если вспомнишь, то найдёшь следующий ключ",
	},
	{
		id: 2,
		game: {
			type: "catchButton",
			rule: 'Сосал сосал?',
			name: 'Сосал?'
		},
		riddle: "Что бы найти следующее задание, вспомни, что Миша - твой брат по разуму",
	},
	{
		id: 3,
		game: {
			type: "findEmoji",
			rule: 'Запоминай, дурья башка',
			name: 'Карточки памяти'
		},
		riddle: "Спроси у Нади её фирменный звук и ты поймёшь в каком направлении двигаться дальше",
	},
	{
		id: 4,
		game: {
			type: "mazeMini",
			rule: 'Сожри эту штуку',
			name: 'ОМНОМНОМ'
		},
		riddle: "Лена причастна к этой Настиной покупке (тут придётся пошевелить мозгами). Ты тупой, мы все это знаем, так что вот подсказка - Насте пришлось купить это по рекомендации Елены Владимировны. Настя стала соучастницей с Е.В., поэтому пришлось сделать эту покупку.",
	},
	{
		id: 5,
		game: {
			type: "codePuzzle",
			rule: 'Надо тупо клацать по цифрам',
			name: 'РАНДОМНЫЕ ЦИФРЫ'
		},
		riddle: "Сярику можно было загадать кальян, но это слишком легко. Поэтому тебе нужно взглянуть на Сёстю",
	},
	{
		id: 6,
		game: {
			type: "catchGame",
			rule: 'Тапай по кружкам так же быстро, как тапаешь на шкоду',
			name: 'СУПЕРТАП'
		},
		riddle: "Следующая подсказка находится там, где хранится результат вашего хобби с Федулычем",
	},
];
